kinton/nrf52_expirements/ble_app_uart_non_fs/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


// fstorage
static void fstorage_evt_handler(nrf_fstorage_evt_t * p_evt)
{
    if (p_evt->result != NRF_SUCCESS)
    {
        NRF_LOG_INFO("--> Event received: ERROR while executing an fstorage operation.");
        return;
    }

    switch (p_evt->id)
    {
        case NRF_FSTORAGE_EVT_WRITE_RESULT:
        {
            NRF_LOG_INFO("--> Event received: wrote %d bytes at address 0x%x.",
                         p_evt->len, p_evt->addr);
            if (mh_len > 0)
              read_and_send();
              
        } break;

        case NRF_FSTORAGE_EVT_ERASE_RESULT:
        {
            NRF_LOG_INFO("--> Event received: erased %d page from address 0x%x.",
                         p_evt->len, p_evt->addr);
            
            if (mh_len > 0)
              write_from_handler();

        } break;

        default:
            break;
    }
}
NRF_FSTORAGE_DEF(nrf_fstorage_t fstorage) =
{
    /* Set a handler for fstorage events. */
    .evt_handler = fstorage_evt_handler,

    /* These below are the boundaries of the flash space assigned to this instance of fstorage.
     * You must set these manually, even at runtime, before nrf_fstorage_init() is called.
     * The function nrf5_flash_end_addr_get() can be used to retrieve the last address on the
     * last page of flash available to write data. */
    .start_addr = FST_START,
    .end_addr   = FST_END,
};


/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
    uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();


    nrf_fstorage_api_t * p_fs_api;
    p_fs_api = &nrf_fstorage_sd;

    ret_code_t rc = nrf_fstorage_init(&fstorage, p_fs_api, NULL);
    APP_ERROR_CHECK(rc);

    print_flash_info(&fstorage);

    /* It is possible to set the start and end addresses of an fstorage instance at runtime.
     * They can be set multiple times, should it be needed. The helper function below can
     * be used to determine the last address on the last page of flash memory available to
     * store data. */
    NRF_LOG_INFO("%d", nrf5_flash_end_addr_get());
            
            // read example
            /*ret_code_t err_code;
            uint8_t    readed_data[tokenlen];
            for (int i = 0; i < tokenlen; i++) {
              readed_data[i] = 0x0;
            }
            // Read data.
            // uint32_t const len  = strtol(argv[2], NULL, 10);
            uint16_t length = 12;
            err_code = nrf_fstorage_read(&fstorage, FST_START, readed_data, length);
            APP_ERROR_CHECK(err_code);
            NRF_LOG_INFO("Readed: \"%s\"", readed_data);*/
        
        // erase example
        /*rc = nrf_fstorage_erase(&fstorage, FST_START, 1, NULL);
        APP_ERROR_CHECK(rc);*/
    
        
        // ed000 -> f4000
        // write example
        /*static char     m_hello_world[] = "hello world";
        // rc = nrf_fstorage_erase(&fstorage, FST_START, sizeof(m_hello_world), NULL);
        // APP_ERROR_CHECK(rc);
        NRF_LOG_INFO("Writing \"%s\" to flash. Start: %d", m_hello_world, FST_START);
        rc = nrf_fstorage_write(&fstorage, FST_START, m_hello_world, sizeof(m_hello_world), NULL);
        APP_ERROR_CHECK(rc);*/


    wait_for_flash_ready(&fstorage);
    NRF_LOG_INFO("Done.");
 
    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
